p_pumpModel/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        //- Master side patch
        name            rotatingAMI1;
        patchInfo
        {
            type            cyclicAMI;
            matchTolerance  0.01;
            neighbourPatch  rotatingAMI2;
            transform       noOrdering;
	    lowWeightCorrection 0.05;	// switch to zero gradient for low weight
        }
        constructFrom patches;
        patches (rotatingAMI);
    }

    {
        //- Slave side patch
        name            rotatingAMI2;
        patchInfo
        {
            type            cyclicAMI;
            matchTolerance  0.01;
            neighbourPatch  rotatingAMI1;
            transform       noOrdering;
			lowWeightCorrection	0.05;
        }
        constructFrom patches;
        patches (rotatingAMI_slave);
    }
);

// ************************************************************************* //
