p_pumpModel/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
	location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    rotatingAMI1
    {
        type            cyclicAMI;
        value           $internalField;
    }
    rotatingAMI2
    {
        type            cyclicAMI;
        value           $internalField;
    }
    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    housing
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    impeller
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    cover
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}

// ************************************************************************* //
