p_pumpModel/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00325;

boundaryField
{
    rotatingAMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    rotatingAMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity	    0.05; // 5% turbulence
        value		    $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    housing
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    impeller
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    cover
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
