p_pumpModel/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2.6;

boundaryField
{
    rotatingAMI1
    {
        type            cyclicAMI;
        value           $internalField;
    }
    rotatingAMI2
    {
        type            cyclicAMI;
        value           $internalField;
    }
    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.015;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    housing
    {
        type            omegaWallFunction;
		value			$internalField;
    }
    impeller
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    cover
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
