p_pumpModel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pcorr)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0.01;
    }
    "(p|pcorr)Final"
    {
        $p;
        tolerance       1e-05;
        relTol          0;
    }
	
    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.01;
    }
    "(U|k|omega)Final"
    {
        $U;
        relTol          0;
    }	
}


PIMPLE
{
    nOuterCorrectors	2;
    nCorrectors			3;
    nNonOrthogonalCorrectors 1;	
	
	residualControl
	{
		U
		{
			tolerance	1e-4;
			relTol		0;
		}
		p
		{
			tolerance	5e-3;
			relTol		0;
		}
	}
}

relaxationFactors
{
	fields
	{
		p		0.3;
		pFinal	1;
	}
	equations
	{
		"U|k|epsilon|omega|R|nuTilda"			0.3;
		"(U|k|epsilon|omega|R|nuTilda)Final"	1;
	}
}

// ************************************************************************* //
